
import 'package:basalon/services/constant.dart';
import 'package:flutter/material.dart';

class TermsAndCondition extends StatefulWidget {
  const TermsAndCondition({Key? key}) : super(key: key);

  @override
  State<TermsAndCondition> createState() => _TermsAndConditionState();
}

class _TermsAndConditionState extends State<TermsAndCondition> {
  @override
  Widget build(BuildContext context) {
    return SafeArea(
      child: SingleChildScrollView(
        child: Column(
          crossAxisAlignment: CrossAxisAlignment.stretch,
          children: [
            // Container(
            //   height: 100,
            //   child: Stack(
            //     children: [
            //       Image.asset(
            //         'assets/top-image.jpg',
            //         width: 300,
            //         fit: BoxFit.fill,
            //       ),
            //     ],
            //   ),
            // )
            SizedBox(
              height: 50,
            ),
            Text(
              'TERM AND CONDITION',
              style: ktextStyleLarge,
              textAlign: TextAlign.center,
            ),
            Row(
              mainAxisAlignment: MainAxisAlignment.center,
              children: [
                Text(
                  'terms and condition',
                  style: ktextStyle,
                  textAlign: TextAlign.center,
                ),
                Text(
                  '>',
                  style: ktextStyle,
                  textAlign: TextAlign.center,
                ),
                Text(
                  'Home',
                  style: ktextStyle,
                  textAlign: TextAlign.center,
                ),
              ],
            ),

            Directionality(
              textDirection: TextDirection.rtl,
              child: Column(
                  crossAxisAlignment: CrossAxisAlignment.stretch,
                  children: [

                    Text('תנאי שימוש',style: ktextStyleLarge,),
                    Text('''
 תנאי השימוש ומדיניות הפרטיות
שימוש באתר זה www.basalon.co.il או בכל אתר שיחליף אותו או יתווסף אליו (“האתר”), על ידך – משתמש הקצה (“משתמש הקצה”) או ספקי הפעילויות (“בית עסק” או “בתי העסק”, לפי העניין), רכישת כרטיסים, הרשמה לאתר, הוספת פעילות ו/או פתיחת חשבון באתר, מהווים, כל אחד מהם, הסכמה לתנאי השימוש שלהלן, הסכם זה הוא בינך לבין basalon, למעט עניינים הקשורות להשתתפות בתכנית מפני המשתתפים שחלות בינך לבין basalon.
במידה ואינך מסכים לתנאי השימוש ומדיניות הפרטיות שלהלן (“תנאי השימוש”), עליך להימנע מכל שימוש באתר.
כל המבצע פעולה באתר מצהיר כי הינו מודע לתנאי השימוש באתר ומקבלם, וכי לא תהא לו ו/או למי מטעמו כל טענה ו/או תביעה ו/או דרישה נגד האתר, basalon ו/או כל חברה קשורה שלה (basalon ו/או כל אחת מחברותיה הקשורות יכונו “קבוצת basalon”), מנהליהם, הדירקטורים ובעלי המניות בהם, סוכניהם, שלוחיהם ו/או כל מי מטעמם, מלבד טענות כנגד basalon הקשורות בהפרת התחייבויות מפורשת של basalon על פי תנאי השימוש.
רק הכללים שיפורסמו בתנאי שימוש אלו יחייבו את basalon כלפי מבצעי הפעולות באתר.
תנאי השימוש מנוסחים בלשון זכר לצרכי נוחות בלבד, אולם הם מתייחסים, כמובן, גם לנשים.
א. השימוש באתר
1. כללי
1.1. האתר מופעל על ידי basalon ומספק שירות מקוון (On-line) ברשת האינטרנט, המספק, בין השאר, שירותי סחר אלקטרוני ושירותי ביצוע הזמנת ויצירת פעילויות ורכישת כרטיסים.
1.2. basalon מציעה למכירה באתר, בין השאר, כרטיסי כניסה לפעילויות, אשר ניתן לממשם אצל בתי העסק וכן הצעות לפעילויות פנאי המוצעות על ידי צדדים שלישיים ללא תשלום או בתשלום שיעשה ישירות מול מציע הפעילות (ולא באמצעות האתר) .
1.3. למען הסר ספק, קבוצת basalon אינה מוכרת ו/או מספקת את הפעילויות ו/או את השירותים המוצגים באתר. הפעילויות ו/או השירותים, אשר לשם רכישתם מבית העסק ניתן להשתמש בכרטיסים הנמכרים באתר, או במקרה של פעילות ללא תשלום על ידי הזמנת הפעילות באמצעות האתר, או במקרה של הצעות לפעילות בתשלום על ידי צדדים שלישיים על ידי הזמנת הפעילות ישירות מאותם צדדים שלישיים, מוצעים על ידי בתי העסק השונים ו/או הצדדים השלישיים כאמור בלבד ולא על ידי קבוצת basalon .
1.4. basalon מעמידה לרשות בתי העסק את האתר כבמה להצגת פעילויות ו/או שירותים ומשמשת רק כצינור להעברת מידע. אין לראות בקבוצת basalon כמי שמוכרת ו/או מספקת את הפעילויות והשירותים או כמי שחבה באחריות כלשהי בגינם.
1.5. תנאי השימוש הם ההסכם הקובע את תנאי השימוש שיחולו על שימוש באתר על ידי משתמשי הקצה ובית העסק. על ידי שימוש באתר, אתה – משתמש הקצה ו/או בית העסק, לפי העניין, מסכים לנהוג על פי כל תנאי השימוש המפורטים לעיל ולהלן.
1.6. זכות השימוש באתר הינה אישית למשתמש הקצה ו/או בית העסק ולא ניתנת להעברה לכל צד ג.
1.7. משתמש הקצה ו/או בית העסק הינו האחראי הבלעדי להגנה על סודיות הסיסמא/ות לאתר ו/או בכל הקשור בו. משתמש הקצה מתחייב לשמור את סיסמת השימוש באתר בסודיות ולא לגלותה לצד שלישי.
1.8. משתמש הקצה ו/או בית העסק מכיר בכך שהשימוש באינטרנט עשוי להיות כרוך בהפרעות שאינן בשליטת basalon , וכי קבוצת basalon לא תהא אחראית לכל שיבוש ברצף השירות ו/או לכל שיבוש ו/או איבוד המידע בזמן העברת מידע על גבי האינטרנט. ייתכן והאתר יהיה לא זמין מעת לעת מכל סיבה שהיא, לרבות בשל תחזוקה שוטפת. בשל נסיבות התלויות ב-basalon וכן בשל נסיבות אשר אינן תלויות בbasalon , יתכן שגישה לאתר תופרע, תושעה ו/או תופסק, באופן זמני או לצמיתות. הנך פוטר את קבוצת basalon בגין כל נזק ו/או תשלום ו/או הפסד שייגרמו לך עקב האמור לעיל.

1.9. ל-basalon תהיה הזכות, בכל עת, לשנות ו/או להפסיק כל מאפיין ו/או תכונה ו/או שימוש של האתר, לרבות תוכן, שעות פעילות וציוד הנדרש לצורך גישה ושימוש באתר. basalon רשאית להפסיק הפצתו של כל מידע, רשאית לשנות או להפסיק כל שיטת העברת מידע ורשאית לשנות את מהירויות העברת המידע או כל מאפיין אותות ו/או מאפיין שידור אחרים, הכל לפי שיקול דעתה וללא צורך לתת הודעה כלשהי מראש.
1.10. כל אדם, לרבות תאגיד, רשאי להשתמש באתר, לרבות לבצע רכישות או מכירות באמצעות האתר בכפוף למילוי התנאים המצטברים המפורטים להלן: הנך בעל כשרות משפטית לביצוע פעולות מחייבות באתר, הנך בגיל מספק על פי חוק ליצור חוזה מחייב – עלייך להיות בן 18 לפחות כדי שתהיה כשיר להשתמש באתר, הנך בעל תא דואר אלקטרוני ברשת האינטרנט והנך בעל כרטיס אשראי בתוקף.
1.11. מבלי לגרוע מהאמור לעיל, תהא basalon רשאית למנוע ממך להשתמש באתר, באופן זמני או לצמיתות, וזאת על פי שיקול דעתה הבלעדי ומבלי למסור הודעה על כך מראש ומבלי חובה לנמק את החלטה. מבלי לגרוע מכלליות האמור, רשאית basalon למנוע ממך את השימוש באתר, בין השאר, בכל אחד מהמקרים הבאים: אם הפרת את תנאי השימוש; ו/או אם מסרת במתכוון פרטים שגויים; ו/או אם ביצעת מעשה או מחדל הפוגעים או העלולים לפגוע ב-basalon ו/או במי מטעמה ו/או בפעילותו התקינה של האתר ו/או בצדדים שלישיים כלשהם, לרבות משתמשי הקצה ובתי העסק; ו/או אם כרטיס האשראי שברשותך ושפרטיו נמסרו לאתר נחסם או הוגבל לשימוש בדרך כלשהי; ו/או אם הפעילות או השירות המוצעים אינם מקובלים על basalon כפעילות או שירות שיוצעו באמצעות האתר לפי שיקול דעתה הבלעדי של basalon .
2. שינוי תנאי השימוש ומדיניות הפרטיות
2.1. basalon רשאית בכל עת לשנות את תנאי השימוש על פי שיקול דעתה הבלעדי ואף ללא סיבה וכן ללא חובת נימוק וללא חובה למסור הודעה בנדון. שינוים אלו יכולים לכלול, בין השאר, הוספת עמלות ותשלומים נוספים.
2.2. במידה וbasalon – תערוך שינויים מהותיים בתנאי השימוש, basalon תודיע לך על כך על ידי משלוח הודעת דואר אלקטרוני לכתובת הדואר האלקטרוני עימה נרשמת ופתחת חשבון אצל basalon ו/או על ידי פרסום הודעה בדבר השינוי האמור באתר ו/או על ידי שינוי תנאי השימוש.

2.3. כל שינוי בתנאי השימוש יחול באופן מידי על כל משמשי האתר (בתי עסק ומשתמשי הקצה) החל ממועד השינוי, אלא אם מדובר בשינוי אשר לדעת basalon הינו שינוי מהותי שאז יחול החל ממועד משלוח הודעת הדואר האלקטרוני האמורה לעיל או ממועד פרסום ההודעה באתר, על פי המוקדם ביניהם, ובתנאי ששינוים אלו לא יחולו על כרטיסים שנרכשו לפני המועד הקובע לתחולת השינויים האמורים. כל שימוש באתר על ידי משתמש קצה ו/או בית העסק אחרי ביצוע השינויים האמורים תחשב הסכמה וקבלה של השינויים האמורים על ידי משתמש הקצה ו/או בית העסק.
2.4. אנו ממליצים לך לקרוא מחדש, מעת לעת, את תנאי השימוש ומדיניות הפרטיות שלנו, כדי להיות מועדכן בשינויים בהם.
3. ציוד
משתמש הקצה ו/או בית העסק יהיה אחראי לקבלת ולאחזקת טלפון, קו תקשורת, מחשב, חומרה וכל ציוד אחר הנדרש (“הציוד”), ככל שנדרש, על מנת לקבל גישה ולעשות שימוש באתר ולכל העלויות הכרוכות בכך. קבוצת basalon לא תהיה אחראית לכל הנזקים לציוד ו/או לתוכנה ו/או למידע של משתמש הקצה ו/או בית העסק כתוצאה משימוש באתר.
4. כללי התנהגות למשתמש הקצה ו/או בית העסק
4.1. האתר הינו קניינה הפרטי של basalon . כל פעילות באתר חייבת להיות בהתאם לתנאי השימוש.
4.2. basalon דורשת כי כל פעילות של משתמש הקצה ו/או בית העסק באתר ו/או בקשר לאתר חייבת להיות למטרות חוקיות בלבד. בנוסף, הפעילות של משתמשי הקצה ו/או בית עסק באתר חייבת להיות לצורך ובקשר עם פרסום, שיווק, מכירת ורכישת כרטיסים לפעילויות פנאי.
4.3. משתמש הקצה ו/או בית העסק לא יפרסם או ישדר דרך האתר כל חומר, אשר מפר בכל דרך שהיא זכויותיהם של אחרים או כל חומר לא-חוקי, מאיים, פוגעני, מטעה, מעליב, משמיץ, דוחה, חודר/מפר פרטיות, וולגרי, גס, מגונה או באופן אחר מעורר התנגדות, מעודד התנהגות פלילית, מקים עוולה אזרחית ו/או שמפר בדרך אחרת כל חוק ו/או דין ו/או אשר מכיל דבר פרסום או שידול בקשר לפעילויות או שירותים כלשהם שאינם חוקיים ו/או שאינו תואם את מטרות האתר, זאת ללא הסכמתה המפורשת של basalon בכתב ומראש, לפי שיקול דעתה הבלעדי והמוחלט.
4.4. כל התנהגות מצד משתמש קצה ו/או בית עסק אשר לפי שיקול דעתה הבלעדי של basalon מגבילה ו/או מונעת ו/או מפריעה למשתמש קצה ו/או בית עסק כלשהו מלהשתמש וליהנות מהאתר הינה אסורה.
4.5. למעט פרסום ושיווק פעילויות ושירותים, רכישת כרטיסים כמפורט בתנאי השימוש, משתמש הקצה ו/או בית העסק לא יעשה שימוש באתר על מנת לפרסם ו/או לשדל מטעמים מסחריים, דתיים, פוליטיים, לא מסחריים ו/או אחרים. בנוסף, אין לעשות שימוש באתר לצורך שידול משתמשי האתר להפוך משתמשים של שירותים אחרים אשר, במישרין או בעקיפין, מתחרים או עשויים להתחרות ב-basalon . האמור בסעיף 4 זה יחול לטובתה של basalon ו/או לטובת כל מי מטעמה, מעת לעת ולפי שיקול דעתה הבלעדי של basalon .
5. קניין רוחני, זכויות יוצרים וסימני מסחר
5.1. כל דבר באתר, לרבות לקט הנתונים, תכנות, יישומים וממשקים, הוא רכושה הקנייני הבלעדי של basalon או שנעשה בו שימוש בהתאם להרשאה מפורשת מבעל הזכויות. כל העתקה, הפצה, שידור, פרסום, יצירת קישור או שינוי בדרך אחרת של האתר מבלי הסכמה מוקדמת מפורשת בכתב מ-basalon לפי שיקול דעתה, אסורה בהחלט. כל הפרה של האמור בסעיף זה, עלולה לגרום לתוצאה של הפרת זכויות יוצרים, זכויות סימני מסחר או זכויות קניין רוחני אחרות, באופן שעלול להשית על משתמש הקצה ו/או בית העסק עונשים ו/או קנסות פלילים ו/או אזרחיים.
5.2. האתר מכיל חומר המוגן על פי דיני זכויות יוצרים, סימני מסחר ותוכן ומידע קנייני אחר, לרבות טקסט, תוכנה, תמונות, וידאו, גרפיקה, מוזיקה וצלילים. למשתמש הקצה ו/או בית העסק אסור לשנות, לפרסם, לשדר ו/או להשתתף בהעברה או מכירה, ליצור עבודות נגזרות או לנצל את התוכן באתר בכל אופן אחר, בשלמותו או בחלקו. אלא אם נקבע אחרת במפורש על פי חוק, כל העתקה, הפצה, שידור, פרסום או ניצול מסחרי של חומר מהאתר, ללא אישור מפורש מ-basalon או מבעל הזכויות בו, הינו אסור. במידה שהעתקה, הפצה, שידור, פרסום, של חומר מוגן בזכויות יוצרים, הינה מותרת, לא יעשו כל שינויים ו/או מחיקות של קרדיט ליוצר, סימני מסחר או הודעת בדבר זכויות היוצרים. משתמש הקצה ו/או בית העסק מכיר בכך שהוא אינו רוכש כל זכויות בעלות על ידי הורדה מהאתר ו/או הורדה מהודעות שקיבל מ-basalon (download) של החומר המוגן מהאתר.
5.3. משתמש הקצה ו/או בית העסק לא יעלה לאתר (upload), יפרסם או ינגיש בדרך אחרת באתר כל חומר המוגן בזכויות יוצרים, סימני מסחר או זכויות קנייניות אחרות מבלי הרשאה מפורשת של בעלי זכויות היוצרים, סימני המסחר והזכויות הקנייניות האחרות. משתמש הקצה ו/או בית העסק יהיה האחראי הבלעדי לכל נזק הנובע מהפרה של זכויות יוצרים, סימני מסחר, זכויות קנייניות אחרות בקשר עם כל חומר שהועלה על ידו כאמור וכל נזק אחר הקשור לכך. על ידי הצגת חומר בכל אזור פומבי באתר או דרכו, משתמש הקצה ו/או בית העסק מצהיר שהבעלים של חומר זה נתן לקבוצת basalon זכות ורישיון בלתי הדיר, לא בלעדי, לא מוגבל בזמן וללא תמורה, לעשות שימוש, לשכפל, להעתיק, לשנות, להתאים, לערוך, לפרסם, לתרגם ולהפיץ את החומר האמור (כולו או חלקו) בכל העולם וכן לשלב חומר זה ביצירות אחרות בכל אופן, בכל מדיה ובכל טכנולוגיה הידועות כיום או שיהיו בעתיד, ללא מגבלות טריטוריה או זמן וכן לתת רישיונות משנה לגבי זכויות אלו, באופן המקסימלי הניתן לגבי כל זכות יוצרים הקיימת בחומר האמור. משתמש הקצה ו/או בית העסק מרשה גם לכל משתמש קצה אחר לגשת, לצפות, לאחסן, לשכפל ולהעתיק את החומר לשימוש האישי של אותו משתמש הקצה. משתמש הקצה ו/או בית העסק מעניק לקבוצת basalon את הזכות לערוך, לשכפל להעתיק, לפרסם ולהפיץ כל חומר שנעשה זמין באתר על ידו. האמור בסעיף 5 זה יחול לטובתה של קבוצת basalon וכן לטובת כל מי מטעמה, מעת לעת ולפי שיקול דעתה הבלעדי של basalon . למרות האמור לעיל, בית עסק רשאי לכלול בפרסומיו באתר הגבלה מפורשת כלפי משתמשי הקצה בדבר זכויות צדדים שלישיים לגבי סימני ושמות מסחר השייכים לו.
5.4. “basalon ” וכן כל סימן מסחר אחר המופיע באתר המכיל את המילה “basalon “, בין שמדובר סימן מסחר המכיל מילים/אותיות בלבד ובין שמדובר סימן מסחר מעוצב, הנו סימן מסחר של basalon  ו/או חברות קשורות מקבוצת basalon , מהווה חלק מקניינם וכל הזכויות בקשר לכך שמורות עמם. כל סימני המסחר האחרים המופעים באתר הינם קניינם של בעליהם החוקיים.
6. אחריות ושיפוי
6.1. משתמש הקצה ו/או בית העסק ו/או מפנה משתמשים מסכים בזאת מפורשות כי השימוש באתר ו/או בלינק ייחודי הוא על אחריותו וסיכונו הבלעדי. קבוצת basalon , מנהליה, הדירקטורים ובעלי המניות בה, סוכניהם, שלוחיהם ו/או כל מי מטעמם, בתי העסק, צדדים שלישיים המספקים תוכן ובעלי רישיונות וכל מנהליהם, הדירקטורים, עובדיהם, סוכניהם ושלוחיהם אינם מצהירים ואינם מתחייבים שהשימוש באתר ו/או בכל לינק ייחודי יהיה נטול הפרעות ו/או חסר תקלות ו/או נטול טעויות ו/או יינתן כסדרו בלא הפסקות. כמו כן, הם אינם ערבים לתוצאות שעלולות להיות מושגות משימוש באתר ו/או בתכנית מפני משתמשים וכן אינם ערבים לדיוק, למהימנות או לתוכן של כל מידע, שירות או כרטיסים שיסופקו באמצעות האתר.
6.2. הגישה ניתנת לאתר כמו שהוא וככל שהוא זמין, על בסיס “AS IS” ועל בסיס “AS AVAILABLE” וקבוצת basalon מסתלקת מכל מצג, אחריות, ערובה, הצהרה ותנאי, בין מפורש ובין מרומזים, לרבות לגבי אי הפרת זכויות קנייניות או חוזיות, סחירות והתאמה למטרה.
6.3. מבלי לגרוע מהאמור לעיל, קבוצת basalon לא תהיה אחראית כלפי בית עסק ו/או משתמש קצה ו/או כלפי מפנה משתמשים ו/או כלפי כל צד שלישי, בגין כל נזק, בין אם ישיר ובין אם עקיף, אשר נגרם עקב שימוש באתר, ו/או רכישת כרטיסים ו/או השתתפות בפעילות ו/או השתתפות בתכנית מפני משתמשים. בין היתר (ומבלי לגרוע מכלליות האמור):
6.3.1. קבוצת basalon אינה, מוכרת ו/או מספקת את הפעילות ו/או השירות אשר בית העסק מציע באתר, ואשר יש בדעת משתמש הקצה לרכוש באתר ולפיכך קבוצת basalon אינה נושאת במישרין ו/או בעקיפין באחריות כלשהי לפעילויות, טיבן, איכותן, כדאיות העסקה, התאמתן לצרכי משתמש הקצה ו/או לתיאור הפעילות ו/או השירות באתר. משתמש הקצה מסכים בזאת במפורשות שהשתתפות בפעילות ו/או בשירות המוצעים באתר הינם באחריותו וסיכונו הבלעדי.
6.3.2. הפעילויות והשירותים באתר מוצגים בתום לב ובאחריות בתי העסק, ואין בהצגתם משום המלצה ו/או הבעת דעה מצד קבוצת basalon לגבי אופיים של הפעילויות ו/או השירותים, תכונותיהם, טיבם, שמות יוצרי הפעילות /ספקים/בתי העסק וכיו”ב. למען הסר הספק, אם וככל שהאתר, קבוצת basalon ו/או מי מטעמם ו/או כל משתמש אחר באתר נתן חוות דעת בקשר עם פעילות ו/או שירות אין בכל כדי להטיל אחריות על קבוצת basalon לגבי אופיים של הפעילויות ו/או השירותים, תכונותיהם, טיבם, סיכון הכרוך בהם, שמות יוצרי הפעילות /ספקים/בתי העסק וכיו”ב.
6.3.3. קבוצת basalon לא תישא במישרין ו/או בעקיפין באחריות כלשהי לכל מקרה שבו רכישה על ידי משתמש הקצה לא התקבלה (מכל סיבה שהיא) ו/או לכל בעיה טכנית המונעת ממשתמש הקצה מלרכוש כרטיסים או לעדכן את הרכישה.
6.3.4. קבוצת basalon לא תישא באחריות לכל מעשה או מחדל בהפרת תנאי השימוש.

6.4. משתמש הקצה ובית העסק הינם האחראים הבלעדיים לכל התקשרות בינם לבין בתי עסק ומשתמשים אחרים באתר. משתמש הקצה משחרר את קבוצת basalon מכל תביעה, דרישה, חבות הקשורים לכל פעילות ו/או שירות של בית עסק, לכל פעולה של בית עסק, לרבות כשל של בית העסק לפעול בהתאם לכל דין וכן כשל של בית העסק לקיים את תנאי הכרטיס, וכן לגבי כל התקשרות, בין אם מקוונות ובין אם לאו, עם כל משתמש קצה אחר.
6.5. בית העסק יהיה אחראי לקבוע את מחיר הכרטיס ולבחון את הכדאיות הכלכלית וההשלכות המיסוייות של הפעילות ו/או השרות אותו הוא מציע. קבוצת basalon אינה אחראית לכל היבט פיננסי הקשור לבית העסק. בית העסק משחרר את קבוצת basalon מכל תביעה, דרישה, חבות הקשורים לכל פעילות ו/או שירות של בית עסק, לכל פעולה של בית עסק, לרבות כשל של בית העסק לפעול בהתאם לכל דין וכן כשל של בית העסק לקיים את תנאי הכרטיס, וכן לגבי כל התקשרות, בין אם מקוונות ובין אם לאו, עם כל משתמש קצה אחר.
6.6. מפני המשתמשים משחררים את קבוצת basalon מכל תביעה, דרישה, חבות הקשורים להשתתפותם בתכנית מפני המשתמשים.
6.7. בית העסק יהיה האחראי הבלעדי לכל פגיעה, מחלה, נזק, תביעה, דרישה, חבות, חסרון כיס, הפסד, הוצאה ו/או כל תשלום אחר, שיגרמו למשתמש הקצה, בקשר עם מימוש הכרטיס ו/או אי מימושו עקב מעשה או מחדל של בית העסק ו/או בקשר עם הפעילויות / השירותים נשוא הכרטיס. משתמש הקצה ו/או בית העסק, לפי העניין, מוותר ומשחרר את קבוצת basalon , מנהליה, הדירקטורים ובעלי המניות בה, סוכניהם, שלוחיהם ו/או כל מי מטעמם מכל דרישה, טענה, תביעה, חבות, פגיעה, מחלה, נזק, תביעה, דרישה, חבות, חסרון כיס, הפסד, הוצאה ו/או כל תשלום אחר.
6.8. משתמש הקצה ו/או בית העסק ו/או מפנה המשתמשים, לפי העניין, מסכים להגן על, לשפות ולפצות את קבוצת basalon, מנהליה, הדירקטורים ובעלי המניות בה, סוכניהם, שלוחיהם ו/או כל מי מטעמם מפני כל תביעה ו/או דרישה, לרבות הוצאות ושכר טרחת עורכי דין, הנובעים או הקשורים לפעילותו שלא על פי תנאי שימוש אלה ו/או שלא כדין, הפרת זכויות קניין רוחני או זכות אחרת של אדם או ישות על ידך או על ידי משתמש קצה ו/או בית עסק אחר הפועל באמצעות מחשבך או סיסמתך.
7. הגבלת אחריות
7.1. בשום מקרה, קבוצת basalon לא תהיה חבה בגין כל נזק ו/או אובדן ו/או הפסד ישיר, עקיף, מקרי, מיוחד, תוצאתי ו/או עונשי, הנובע ו/או קשור להסכם זה.
7.2. מבלי לגרוע מכלליות האמור, בשום מקרה, (א) חבותה ואחריותה של קבוצת basalon כלפי משתמש קצה, בשל כרטיס ו/או בקשר אליו, לא תהיה גבוהה מהסכומים שנגבו על ידי basalon בפועל ממשתמש הקצה בגין אותו כרטיס, וסך האחריות והחבות הכוללת של קבוצת basalon הנובעת או הקשורה להסכם זה, לא תהיה גבוהה יותר מהסכומים ששולמו בפועל על ידי משתמש הקצה עבור רכישת כרטיסים עבור הפעילות נשוא הטענה שהועלתה על ידי משתמש הקצה נגד קבוצת basalon , (ב) חבותה ואחריותה של קבוצת basalon כלפי בית העסק, בשל כל סיבה שהיא, לא תהיה גבוהה מהסכומים ששולמו בפועל ל-basalon על ידי משתמשי הקצה בעבור רכישת כרטיסים לפעילות ו/או שירות המוצע על ידי בית העסק, וסך האחריות והחבות הכוללת של קבוצת basalon הנובעת או הקשורה להסכם זה, לא תהיה גבוהה יותר מהסכומים ששולמו בפועל על ידי משתמשי הקצה כאמור עבור הפעילות נשוא הטענה שהועלתה על ידי בית העסק נגד קבוצת basalon , ו-(ג) סך כל חבותה ואחריותה הכוללת של קבוצת basalon כלפי מפנה משתתפים, בשל כל סיבה שהיא, לא תהיה גבוהה מסכום עמלת מפנה המשתמשים לו זכאי מפנה משתמשים ואשר עדיין לא שולמה על ידי basalon למפנה המשתמשים.
8. בקרה, פיקוח ומעקב
ל-basalon תהיה הזכות, אך לא החובה, לבקר, לפקח ולעקוב אחר התוכן באתר בכל עת, לרבות בחדרי הצ’ט ובפורומים, אם וככל שיהיו חלק מהאתר, לקבוע האם השימוש באתר נעשה בהתאם להסכם זה ובהתאם לכל הכללים שיקבעו, ככל שיקבעו מעת לעת, על ידי basalon , כמו גם התאמה לכל חוק, דין, תקנה, רגולציה ו/או בקשה/הוראה של גוף מוסמך. מבלי לגרוע מהאמור לעיל, basalon תהא זכאית (אך לא מחויבת) להסיר כל חומר, אשר basalon סוברת, על פי שיקול דעתה הבלעדי, שהוא מפר את תנאי שימוש אלו או מכל סיבה אחרת לרבות כמפורט בסעיף 21 לעיל).
9. פרטיות וסודיות
9.1. משתמש הקצה ו/או בית העסק מכיר בזאת שכל הדיונים, דירוגים, הערות, שירות לוח המודעות, חדרי הצ’ט, תמונת הפרופיל, שם המשתמש והפעילות באתר ו/או כל תשתיות הודעות ותקשורות באתר (“קהילות”) הם פומביים ואינן תקשורות פרטיות, ולכן צדדים שלישים רשאים לקרוא את התקשורות של משתמש הקצה ו/או בית העסק וכן לצפות בתמונת הפרופיל, שם המשתמש והפעילות שביצע באתר מבלי ידיעתו. קבוצת basalon אינה שולטת או נותנת חסות לתוכן, להודעות או למידע הנמצא בכל קהילה ולכן קבוצת basalon מסתלקת באופן מפורש מכל חבות הנוגעת לקהילות ואינה אחראית לשום תוצאה הנובעת מהשתתפות משתמש הקצה ו/או בית העסק בקהילות. כל מידע שמשתמש קצה ו/או בית העסק מפרסם ו/או שנוצר על ידי השימוש באתר, בין אם בחדרי הצ’ט, בחדרי הדיונים, על לוחות המודעות או בכל דרך אחרת, אינו מידע שחלה עליו סודיות כלשהי. על ידי פרסום הערות, הודעות ו/או מידע אחר באתר, משתמש הקצה ו/או בית העסק מקנה לקבוצת basalon את זכות השימוש באותן הערות, הודעות ו/או מידע אחר לצורך קידום מכירות, פרסום, חקר שוק וכן לכל מטרה חוקית אחרת מבלי הגבלה של טריטוריה, זמן או כל הגבלה אחרת.
9.2. כל פרטיו האישיים של משתמש הקצה ו/או בית העסק (שם, תמונת הפרופיל, דואר אלקטרוני וכדומה) שמסר משתמש הקצה ו/או בית העסק במסגרת רישומו לאתר ושימושו באתר, ומידע שייאסף אודות דפוסי השימוש של משתמשי הקצה ו/או בתי העסק, יישמרו במאגרי המידע של קבוצת basalon .
9.3. קבוצת basalon תהא רשאית להשתמש בפרטיו האישיים של משתמש הקצה ו/או בית העסק ובמידע שתאסוף אודות דפוסי השימוש שלהם באתר, בכפוף לכל דין, לרבות לצורך:
9.3.1. העברת המידע לבית העסק לצורך הפעילות ו/או השירות נשוא רכישת הכרטיסים בלבד. מובהר בזאת כי בית העסק אינו רשאי לעשות כל שימוש אחר במידע שיועבר אליו מבלי לקבל את הסכמתו המפורשת של משתמש הקצה אשר רכש את הכרטיס;
9.3.2. שיפור ותחזוקת השירותים, המידע והתכנים המוצעים באתר;
9.3.3. לשנות ו/או לבטל שירותים ותכנים הקיימים באתר;
9.3.4. מתן הודעות בקשר עם האתר והשימוש בו;
9.3.5. ניתוח מידע סטטיסטי והצגתו ו/או מסירתו לצדדים שלישיים, ובלבד שהמידע כאמור יהיה אנונימי.

9.4. קבוצת basalon לא תעשה כל שימוש בפרטים של אמצעי התשלום של משתמש הקצה אלא לביצוע תשלום בגין עסקה אותה ביקש משתמש הקצה לערוך, ופרטים אלו לא יועברו לאף גורם אחר זולת לצורך זה.
9.5. פרטי כרטיס האשראי אינם נשמרים במאגרי המידע של קבוצת basalon .
9.6. קבוצת basalon לא תמכור ו/או תשכיר ו/או תעביר את פרטיו האישיים של משתמש הקצה ו/או בית העסק, כפי שנמסרו לה על ידם, כולם או חלקם, לצד שלישי כלשהו, למעט לגוף מסונף אליה (חברת בת, חברת אם, חברה אחות, חברה בשליטה משותפת עם basalon וכו’). אין באמור כדי למנוע מ קבוצת basalon להעביר מידע סטטיסטי שאינו כולל פרטים מזהים לצדדים שלישיים.
9.7. למרות האמור לעיל, קבוצת basalon תהא רשאית להעביר פרטיו האישיים של משתמש הקצה ו/או בית העסק לצד שלישי במקרים הבאים:
9.7.1. כאשר התקבלה הסכמת משתמש הקצה ו/או בית העסק;
9.7.2. משתמש הקצה ו/או בית העסק ביצע מעשה או מחדל הפוגעים ו/או העלולים, לפי שיקול דעתה הבלעדי של basalon , לפגוע בקבוצת basalon ו/או בצדדים שלישיים כלשהם; משתמש הקצה ו/או בית העסק עשה שימוש בשירותי basalon באופן אשר לפי שיקול דעתה הבלעדי של basalon עשוי להיות מעשה בלתי חוקי; אם התקבל בידי קבוצת basalon צו שיפוטי המורה לה למסור את פרטי משתמש הקצה ו/או בית העסק לצד שלישי וכן בכל מחלוקת או הליכים משפטיים;
9.7.3. במקרה שבו basalon תעביר בכל צורה שהיא את פעילות האתר לתאגיד כלשהו וכן במקרה שתתמזג עם גוף אחר או תמזג את פעילות האתר עם פעילותו של צד שלישי, ובלבד שתאגיד זה יקבל על עצמו כלפי משתמשי הקצה ובתי העסק את הוראות תנאי השימוש.

9.8. פעילות האתר מבוצעת בסביבה מקוונת. לפיכך אין באפשרותה של קבוצת basalon להבטיח חסינות מוחלטת מפני חדירות למחשביה או חשיפת המידע האגור בידי מבצעי פעולות בלתי חוקיות. אם יעלה בידי צד שלישי לחדור למידע אשר שמור בידי קבוצת basalon  ו/או להשתמש בו לרעה, לא תהיה למשתמש הקצה ו/או לבית העסק כל טענה, תביעה או דרישה כלפי קבוצת basalon .
9.9. בקרות מקרים שאינם בשליטתה של basalon ו/או הנובעים מכח עליון, קבוצת basalon לא תהא אחראית לכל נזק מכל סוג שהוא, עקיף או ישיר, שייגרם לך ו/או למי מטעמך עם מידע זה יאבד או אם יעשה בו שימוש לא מורשה.
9.10. קבוצת basalon תהא רשאית לעשות שימוש ב – “עוגיות” (“cookies”) על מנת לספק למשתמש הקצה ו/או לבית העסק שירות מהיר ויעיל ולחסוך ממשתמש הקצה ו/או בית העסק את הצורך להזין את פרטיו האישיים בכל כניסה לאתר.
10. ביטול הסכם זה
basalon רשאית לבטל הסכם זה בכל עת ומכל סיבה שהיא ואף ללא סיבה, על פי שיקול דעתה הבלעדי, ומבלי שתהיה חייבת למסור הודעה על כך למשתמש הקצה ו/או בית העסק. ביטול הסכם זה לא יפגע בהמשך תחולת תניות שעל פי טבען להישאר בתוקף אף לאחר ביטול חוזה, לרבות תניות סעיפים 2, 4, 5, 6, 7 ו- 9.
11. תוכן צדדים שלישיים
11.1. כל תוכן של צד שלישי המופיע באתר, לרבות, דעות, המלצות, עצות, הצהרות, שירותים וכן כל מידע אחר או תוכן אחר המבוטא או מונגש על ידי צדדים שלישיים, לרבות על ידי ספקי תוכן או מידע וכן על ידי כל משתמש קצה ו/או בית העסק (“תוכן צד שלישי”), נעשה על ידם ועל אחריותם הבלעדית ולא על ידי קבוצת basalon , ולקבוצת basalon לא תהיה כל אחריות בקשר לכך.
11.2. קבוצת basalon לא נותנת חסות ולא אחראית לדיוק, לנכונות, לשלמות ולשימושיות של כל תוכן צד שלישי. בשום נסיבות, קבוצת basalon לא תהיה אחראית וכן לא תחוב בגין כל נזק ו/או הפסד שנגרמו בשל הסתמכות משמש קצה על מידע שהושג דרך האתר. זוהי אחריותו של משתמש הקצה ו/או בית העסק להעריך את הדיוק, הנכונות, המהימנות, השלמות ו/או השימושיות של כל תוכן צד שלישי הקיים באתר.
11.3 האתר עשוי להכיל קישורים לאתר אינטרנט המופעלים על ידי צדדים שלישיים. קישורים אלו ניתנים לנוחות משתמש הקצה ו/או בית העסק בלבד, ואינם מעידים על מתן חסות של קבוצת basalon לתכנים הנמצאים באתרי אינטרנט אלו. קבוצת basalon אינה אחראית לכל מצג ו/או תוכן, של אתרים אלו וכן אינה אחראית לדיוק, לנכונות, למהימנות, לשלמות ו/או לשימושיות של כל תוכן ומידע המופיע באתרים אלו. משתמש הקצה ו/או בית העסק מודע לכך שייתכן שביקור באתר אינטרנט שלינק אליו מופיע באתר יגרום לו לנזקים נוספים, לרבות עקב וירוסים, רוגלות, ותוכנות זדוניות אחרות. אם משתמש הקצה ו/או בית העסק מחליט להיכנס לאתר אינטרנט של צד שלישי דרך לינק המופיע באתר, הוא עושה זאת על אחריותו ובלעדית כאשר כל הסיכונים בנוגע לכך רובצים עליו. קבוצת basalon לא תהא אחראית לכל נזק ישיר ו/או עקיף, הפסד או אובדן שייגרם ו/או עלול היה להיגרם כתוצאה משימוש או כתוצאה מהסתמכות על המידע המופיע באתרי האינטרנט שתגיע אליהם באמצעות הקישורים באתר.
11.4. לינקים לאתר אפשר ויועלו לאתרי צדדי ג’, בין היתר במסגרת תכנית מפני המשתמשים. האתרים אליהם מועלים ליניקים לאתר, בין היתר על ידי מפני המשתמשים, אינם בניהולה בשליטתה של basalon , ו-basalon אינה בודקת את התוכן ו/או את הפעילות של אתרים חיצוניים אלו ואינה אחראית להם.
12. משלוח הודעות על ידי basalon ו/או מי מטעמה למשמשי הקצה ו/או בית העסק
12.1 על מנת שתהיה מעודכן בהצעות המתפרסמות באתר מעת לעת, basalon חפצה לשלוח לך הודעות דואר אלקטרוני לעדכונך בנדון, וזאת לכתובת הדואר האלקטרוני שמסרת ל-basalon עת פתיחת החשבון באתר. הנך מאשר בזאת ל קבוצת basalon ו/או למי מטעמה לשלוח לך הודעות דואר אלקטרוני כאמור, במידה ומסרת את מספר הטלפון שלך הנך מאשר לקבוצת basalon ו/או למי מטעמה (לרבות בית העסק) לשלוח לך הודעות עדכון דחופות כגון במקרה של ביטול או שינוי מועד ומיקום פעילות אליה נרשמת (אך אין באמור כדי ליצור מחויבות כלשהי על קבוצת basalon או על בית העסק למסירת הודעות כאמור). באם הנך חפץ להפסיק לקבל הודעות דואר אלקטרוני או הודעות באמצעות הטלפון כאמור, הנך מוזמן לפנות למחלקת שירות הלקוחות של basalon בכתובת הדואר האלקטרוני support@basalon.co.il ולבקש להסירך מרשימת התפוצה.
12.2 בית העסק מאשר ש קבוצת basalon רשאית לשלוח לו הודעות דואר אלקטרוני ככל הנדרש לשם פעילות תקינה של חשבונו באתר. בית עסק אשר ביקש להפסיק את קבלת הדואר האלקטרוני מקבוצת basalon יראוהו כמי שמסכים להסרת וביטול החשבון שלו ב-basalon שכן קבלת דואר אלקטרוני על ידי בית העסק מהווה תנאי לפעילות בית העסק באתר.
12.3 כמו כן, באישורך את תנאי שימוש אלה הנך מביע הסכמתך לכך שקבוצת basalon ו/או מי מטעמה תהיה רשאית לפנות אליך מעת לעת בהצעות שיווקיות ופרסומיות, לרבות באמצעות דיוור ישיר, הודעות SMS, דואר אלקטרוני, פקסימיליה, מערכת חיוג אוטומטי ו/או באמצעות כל דרך תקשורת אחרת כלשהי.
ב. הכרטיסים
13. הכרטיסים- כללי
13.1 כל הכרטיסים הנרכשים מהאתר או דרך האתר לרבות מכל אתר המקושר עם basalon (“הכרטיס” או “הכרטיסים”, לפי העניין) הם כרטיסים המקנים זכות השתתפות בפעילות, אשר ניתן לרכושם מbasalon – ולהציגם לבית העסק על מנת להשתתף בפעילות כפי שהוצגה על ידי בית העסק ובהתאם לתנאים החלים על כל כרטיס כפי שיוצגו באתר על ידי בית העסק ועל ידי basalon . על ידי מתן הצעה לרכישת כרטיס על ידי משתמש הקצה באתר, משתמש הקצה נותן הצעה לרכישה בהתאם לתנאים המפורטים להלן.

13.2 basalon מאפשרת לך לרכוש כרטיס אשר ניתן לפדותו בקשר להשתתפות בפעילות ו/או שירותים מבית העסק, בכפוף לתנאי שימוש אלה ולתנאי העסקה הרלוונטית. בית העסק בלבד ולא קבוצת basalon , הוא מספק את הפעילות ו/או השירותים הרלוונטיים ובית העסק הוא האחראי היחידי למימוש הכרטיס שרכשת, בכפוף לאמור בסעיף 6 לעיל.
14. רכישת הכרטיס
14.1 רכישת הכרטיס תקנה זכות חוזית מוגבלת למימוש הכרטיס מול בית העסק שהנפיק את הכרטיס בלבד, הכפופה לזכויות החוזיות של basalon מול אותו בית עסק, אך בכל מקרה לא תקנה זכות חוזית או כל זכות אחרת מול קבוצת basalon . רכישת הכרטיסים באתר תהא מוגבלת בזמן (אף של- basalon הזכות מפעם לפעם להאריך את מכירת הכרטיסים), מכירת כרטיסים עשויה להיות תלויה במספר מינימלי של רוכשים או מוגבלת במספר מקסימלי של רוכשים, הכל בהתאם לתנאים שיפורטו באתר .
14.2 הכרטיסים לפעילויות ו/או שירותים שניתן לרכוש באמצעות האתר אינם משקפים בהכרח את המחיר הנמוך ביותר בשוק עבור אותן פעילויות ו/או שירותים. “השווי” המוצג בנוגע לכל פעילות ו/או שירות הוא כפי שנמסר ל- basalon על ידי בתי העסק, ובאחריותו של משתמש הקצה לבדוק ולערוך השוואת מחירים.
14.3 אתה נדרש לפתוח חשבון אצל basalon כדי ש-basalon תוכל לספק לך גישה קלה לרכישת הכרטיסים, להדפסת הכרטיסים וכן לשירותים נוספים שיש ויינתנו על ידי basalon מעת לעת ועל פי שיקול דעתה הבלעדי של basalon  כדוגמת עיון בהזמנותיך בעבר.
14.4 בנוגע לרכישת כרטיסים, משמעות הלחיצה על כפתור ה – “קנה”, וסיום ההליכים הנלווים לרכישה, לרבות הליך התשלום, היא שמשתמש הקצה הציע הצעה לרכוש הפעילות ו/או השירות הרלוונטי מבית העסק בהתאם לכל התנאים וההתניות שייקבעו על ידי basalon ובית העסק והנכללים באתר, לרבות בקשר עם הכרטיס הרלוונטי. למען הסר ספק, אין כל ודאות ו/או חובה כי הצעתו של משתמש קצה תאושר והעסקה תושלם, לרבות במקרים שהצעות של משתמשים אחרים בנוגע לאותה רכישה אושרו.
14.5 הזכויות שמקנה כל כרטיס יהיו כפופות לתנאי כל עסקה ולתנאי כל כרטיס, שיקבעו על ידי basalon  ובתי העסק, כפי שיהיו מעת לעת וכפי שיופיעו בתנאי השימוש, בהצגת העסקה באתר ו/או על גבי הכרטיס. בכל מקרה של סתירה ו/או אי התאמה בין התנאים המופיעים בהצגת העסקה באתר או על גבי הכרטיס, תכריע basalon בדבר התנאי שיגבר על פי שיקול דעתה הבלעדי, וקביעה זו תחייב.
15. קופונים
ל-basalon זכות להציע למשתמשי הקצה מפעם לפעם ולי שיקול דעתה, באמצעות האתר או בכל דרך אחרת, קופונים (“קופונים”) אשר יכולים להקנות הנחות מסוימות ברכישת כרטיסים, זכות לקבל כרטיסים בחינם בכל קנייה של מספר כרטיסים מסוים או הצעות אחרות דומות, הכל כפי שיצוין בהודעת ההצעה של אותו הקופון. ל-basalon זכות להציע את הקופונים למשתמשי קצה מסוימים לשימושם בלבד או לקבוצה מסוימת של משתמשי קצה לשימוש משתמשי קצה הנמנים על אותה קבוצה בלבד, או לכל משתמשי הקצה (במקרה בו קופון מוצע למשתמש קצה ספציפי או לקבוצה מסוימת של משתמשי קצה, השימוש בקופון על ידי אחר מלבד משתמש הקצה הספציפי או משתמש קצה הנמנה על הקבוצה המסוימת, בהתאמה, הינו אסור). ההנחה הגלומה בקופון יכולה לחול ביחס לרכישתם של כרטיסים לפעילות ספציפית, או לקבוצת פעילויות או לכל הפעילויות המוצעות באתר, הכול כפי שיצוין בהודעת ההצעה של אותו הקופון. קופון יכול לחול ביחס לרכישתו של כרטיס בודד או מספר כרטיסים ויכול להיות חד פעמי או לשימוש חוזר, הכול כפי שיצוין בהודעת ההצעה של אותו הקופון. אלא אם כן נאמר אחרת בהודעת ההצעה של אותו קופון, כל קופון נועד לשימוש, בין אם שימוש חלקי או שימוש מלא, בבת אחת. קופון שנעשה בו שימוש חלקי לא יזכה את משתמש הקצה ליתרה הנותרת של אותו קופון ובעקבות השימוש החלקי הקופון לא יקנה למשתמש הקצה כל זכות נוספת שהיא, כולל, בין היתר, זכות להחזר מכל סוג או זכות להשתתף בפעילות כלשהי. כל קופון יהיה תקף עד לתאריך מסוים או במשך טווח תאריכים אשר יצוין בהודעת ההצעה של אותו קופון. קופון חסר תוקף, לרבות קופון שלא נעשה בו שימוש, לא יקנה כל זכות שהיא, לרבות (ומבלי לגרוע מכלליות האמור) זכות להחזר מכל סוג או זכות להשתתף בפעילות כלשהי. basalon לפי שיקול דעתה הבלעדי, יכולה לשנות את תנאיו של כל קופון או לבטלו, בין היתר (מצבלי לגרוע מכלליות האמור), גם לאחר שהקופון כבר הוצע וטרם נעשה בו שימוש, עד למועד השימוש באותו הקופון (למען הסר ספק, כרטיסים שנרכשו תוך שימוש בקופונים עדיין יכולים להתבטל בכפוף לאמור בתניות שימוש אלו).
16. נקודות קרדיט
ל-basalon הזכות להעניק למשתמש קצה נקודות קרדיט (“נקודות קרדיט”) בתמורה לביצוע של פעולות שונות אשר יפורטו באתר (כגון, אך לא בהכרח, הרשמה לאתר או הפניית משתמשי קצה אחרים לאתר) על ידי משתמש הקצה (“פעולות המזכות בקרדיט”) בכמויות ובכפוף להגבלות ותנאי שימוש אשר יפורסמו באתר מעת לעת. ל-basalon הזכות לשנות את המאפיינים של ו/או להוסיף ו/או להסיר פעולות המזכות בקרדיט לפי שיקול דעתה הבלעדי ללא כל חובה להודיע לכל משתמש קצה שהוא על השינוי ו/או ההוספה ו/או ההסרה כאמור. כל נקודות קרדיט שיוענקו למשתמשי קצה ייצגו ערך מסוים ו/או יאפשרו שימוש בנקודת קרדיט לתשלום חלק ממחירי כרטיסים מסוימים כפי שתחליט basalon לפי שיקול דעתה הבלעדי. basalon לפי שיקול דעתה הבלעדי יכולה להטיל מגבלות או לשנות מגבלות קיימות על השימוש בנקודות קרדיט אשר צבר משתמש קצה (גם לאחר הענקתם למשתמש הקצה) כגון, מבלי הגבלה: (א) מספר מקסימאלי של נקודות קרדיט אשר יכול לצבור כל משתמש קצה; (ב) תקופת תוקף לשימוש בנקודות קרדיט אשר תמנה מהענקתן ושלאחריה תתבטל אותה נקודת קרדיט ולא יהיה ניתן להשתמש בה יותר; ו – (ג) הגבלת סוגי הכרטיסים אותם ניתן לרכוש באמצעות נקודות קרדיט, הכל כפי שיפורט באתר מעת לעת או בהודעה למשתמש הקצה המחזיק באותן נקודות קרדיט. נקודות קרדיט שהוענקו למשתמש קצה אינן ניתנות להעברה ומיועדות רק לרכישת כרטיסים על ידי משתמש קצה לו הוענקו בלבד. ל- basalon , לפי שיקול דעתה הבלעדי, בכל עת עד למועד השימוש בנקודות הקרדיט שהוענקו וגם לאחר הענקת נקודת הקרדיט ולפני השימוש בם, הזכות לבטל נקודות קרדיט שהוענקו. לאחר השימוש בנקודת קרדיט לרכישת כרטיס תתבטל נקודת הקרדיט (ניתן לעשות שימוש בכל נקודת קרדיט פעם אחת בלבד). נקודת קרדיט לא תקפה או מבוטלת לא תקנה כל זכות שהיא, כולל בין היתר זכות להחזר מכל סוג או זכות להשתתף בפעילות כלשהיא.
17. הפעילויות/השירותים המופיעים באתר
קבוצת basalon אינה מוכרת ו/או מספקת את הפעילויות ו/או השירותים המוצגים באתר. basalon מעמידה לרשות בתי העסק את האתר כבמה להצגת ומכירת פעילותיהם ושירותיהם. בדף המכירה של כל פעילות ופעילות מופיעים התנאים למכירת הפעילות כפי שנמסרו על ידי בתי העסק. תמונות הפעילויות באתר נועדו להמחשה בלבד וייתכנו הבדלים בין התמונה לבין הפעילות/השירות הנמכר. פרטי הפעילויות, תיאורם וכל מידע על הפעילויות לרבות מחיר הפעילויות נמסרים על-ידי בתי העסק ובאחריותם. קבוצת basalon אינה מפקחת על המידע ונכונותו. האחריות למידע, טיבו ואמינותו מוטלת, אפוא, כולה על בית העסק. קבוצת basalon אינה אחראית על תיאור הפעילויות כפי שנמסרו על ידי בית העסק.
18. רישום באתר ורכישת כרטיס
בעת הרישום ועל מנת לבצע רכישה או מכירה באתר יהיה עליך להירשם באמצעות חשבונך הפרטי באתר פייסבוק או להזין טופס רישום הכולל את הפרטים הבאים שלך: שם פרטי, שם משפחה, דואר אלקטרוני, בחירת סיסמא, טלפון וכתובת. בעת רכישת הכרטיס יהיה עליך להזין בנוסף את פרטי כרטיס אשראי. על ידי הרשמה לאתר עם חשבון של פייסבוק, הנך מעניק לקבוצת basalon הרשאה לגשת ולהשתמש במידע שלך דרך חשבון זה, כפי שהותר על ידי פייסבוק, ולאחסן את אישורי ההתחברות שלך לפייסבוק על מנת לאפשר את השימוש באתר וכן הנך מאשר כי תהא כפוף לכל תנאי השימוש של פייסבוק בנוסף לתנאי שימוש אלו. בעצם הזנת הפרטים האמורים הנך מצהיר כי אלו הפרטים שלך וכי הם נכונים, מדויקים ומלאים וכי כרטיס האשראי, הדואר האלקטרוני וקו הטלפון הינם בבעלותך. במידה והזמנה תבוצע ללא הפרטים המלאים שלך, basalon תהיה רשאית לבטל את ההזמנה. על פי חוק אינך חייב למסור את הפרטים בטופס הרישום ומסירתם תלויה ברצונך בלבד. עם זאת, אם לא מסרת את כל הפרטים המבוקשים לא תוכל להשתתף ברכישת הכרטיס. לbasalon – ו/או לבתי העסק שמורה הזכות לבטל את השתתפותך/רכישתך מכל סיבה שהיא בכל עת ומבלי שתדרש לנמק, בשל הגשת פרטים כוזבים, חלקיים או לא מדוייקים. הגשת פרטים כוזבים ביודעין הינה עבירה פלילית עפ”י חוק. קבוצת basalon ו/או בתי העסק יהיו רשאים לנקוט בכל צעד משפטי, כולל פנייה לערכאות, כנגד מגישי פרטים כוזבים כולל תביעות נזיקין בגין נזקים שיגרמו לבית העסק ו/או לקבוצת basalon ו/או מי מטעמם עקב שיבוש פעילות האתר ו/או הליכי המכירה באתר. מועד קבלת ההצעה שלך כפי שנרשם במחשבי קבוצת basalon הוא המועד הקובע לכל דבר ורישומו במחשבי קבוצת basalon ישמש ראיה מכרעת בעניין זה.
19. תשלום
19.1. המחירים המוצגים באתר (כולל בשקלול של כל הנחה עקב השימוש בקופון או נקודות קרדיט) כוללים מע”מ וכל מס אחר ומהווים את המחיר הסופי אותו ישלם משתמש הקצה עבור הפעילות ו/או השירות, ככל שהדבר מחויב על-פי הדין, אלא אם צוין אחרת במפורש. בעל העסק מתחייב שלא לקבל כל תשלום ממשתמש הקצה עבור הפעילות ו/או השירות המסוימים שעבורם רכש משתמש הקצה כרטיסים באתר או שבגינם פנה משתמש הקצה לבית העסק דרך האתר שלא דרך basalon ומשתמש הקצה מתחייב לשלם עבור הפעילות ו/או השירות המסוימים שעבורם רכש משתמש הקצה כרטיסים באתר או שבגינם פנה לבית העסק דרך האתר אך ורק דרך basalon .
19.2. רכישת כרטיס שאושרה מהווה רכישה של הפעילות ו/או השירות המחייבת בתשלום מלוא הסכום על ידי הרוכש.
19.3. חיוב הרוכש יתבצע על ידי basalon וזאת באמצעות כרטיס האשראי שאת פרטיו מסר (במידה ולא נמסרו פרטים מלאים, basalon תהא רשאית לבטל רכישה שאושרה).
19.4. במקרה בו חברת כרטיסי האשראי תסרב לכבד את התחייבויותיו, של הרוכש, תבוטל הרכישה, הכרטיס לא יסופק לרוכש והרוכש יחויב בדמי ביטול כמפורט בסעיף 18.6 להלן.
19.5. אישור בדבר פרטי העסקה לאחר ביצוע הקניה יישלח באמצעות הדואר האלקטרוני .
basalon .19.6 תשמור את התשלום בגין הפעילות ותזכה את בית העסק רק לאחר סיום הפעילות במידה ו משתמש הקצה לא ביטל את השתתפותו בפעילות בהתאם לסעיף 18 להלן.
19.7. בנוסף, ומבלי לגרוע מכל הוראה אחרת בתנאי שימוש אלו (לרבות, מבלי לגרוע מכלליות האמור, כל הוראה בקשר עם אחריותה המוגבלת של basalon ), אם וככל שהפעילות נשוא כרטיס מסוים בוצעה שלא בהתאם לטיב, איכות, ו/או התאמה למשתמש הקצה כמצופה מפעילות באיכות גבוהה ו/או לתיאור הפעילות ו/או השירות באתר, כפי שיקבע על ידי basalon לפי שיקול דעתה, בין היתר בהסתמך על מידע שיתקבל אצל basalon ממשתמשי קצה, תהיה רשאית basalon לקבוע, לפי שיקול דעתה הבלעדי, כי משתמש(י) הקצה זכאי(ם) להחזר כספי עבור הכרטיס(ים) ובמקרה כזה בית העסק לא יהיה זכאי לכל תשלום בגין הכרטי(ים) ו/או יידרש להשיב את תמורתם (ככל שכבר קיבל מ- basalon תשלום עבורם), והוראות סעיף 27 יחולו, בשינויים המחוייבים.
20. ביטול רכישה על ידי משתמש הקצה
20.1. ביטול רכישת כרטיס יעשה באמצעות פניה דרך כפתור “בטל הזמנה” באתר או באמצאות תקשורת אלקטרונית (כדוגמת דואר אלקטרוני) לפחות 48 שעות לפני מועד הפעילות, יכלול את פרטי הרוכש ואת פרטי ההזמנה, ויחולו עליו התנאים המפורטים בסעיף 18 זה.
20.2. בנוסף (מבלי לגרוע מתקופות הביטול בסעיף 18.1) בכל הקשור לביטול עסקת מכר מרחוק מול basalon על ידי משתמש הקצה הרי שיחולו גם הוראות חוק הגנת הצרכן התשמ’א-1981 (‘חוק הגנת הצרכן’).
20.3. הנך רשאי לבטל רכישת כרטיס אשר הינה עסקת מכר מרחוק בהודעה בכתב כמפורט להלן:
בעסקה המתייחסת לשירות – ניתן לבטל את העסקה בתוך 14 ימים מיום עשיית העסקה או מיום קבלת המסמך המכיל את פרטי העסקה כאמור בחוק הגנת הצרכן, לפי המאוחר מביניהם, כמפורט להלן: בעסקה מתמשכת – בין אם הוחל במתן השירות ובין אם לאו, ובעסקה שאינה עסקה מתמשכת – בתנאי שביטול כאמור ייעשה לפחות שני ימים, שאינם ימי מנוחה, קודם למועד שבו אמור השירות להינתן.
בוטלה עסקה מתמשכת, שהוחל במתן השירות לפיה, ישלם הצרכן את התמורה היחסית בעד השירות שניתן לו עד למועד הביטול.
20.4. תוצאות ביטול הרכישה יהיו כמפורט בחוק הגנת הצרכן.
20.5. בעסקת מכר מרחוק אין זכות ביטול במקרים הבאים: לגבי ‘טובין פסידים’ כמשמעם בחוק הגנת הצרכן; שירותי הארחה, נסיעה, חופש או בילוי, אם מועד ביטול העסקה חל בתוך שבעה ימים שאינם ימי מנוחה, קודם למועד שבו אמור השירות להינתן; לגבי פעילות שהיא מידע (נתונים, סימנים, מושגים או הוראות, למעט תוכנות) כהגדרתו בחוק המחשבים, התשנ’ה- 1995; טובין שיוצרו במיוחד בעבור הצרכן בעקבות העסקה; טובין הניתנים להעתקה שכפול והקלטה לאחר פתיחת אריזתם המקורי.
20.6. דמי ביטול – בכפוף לכך שלא נעשה שימוש בכרטיס ובכפוף לייתר התנאים המפורטים בתנאי שימוש אלו, בתוך 14 יום מיום קבלת הודעת הביטול יושב לך הסכום ששולם על ידך בגין הכרטיס בניכוי דמי ביטול בשיעור של 5% מסכום העסקה או 100 ש”ח, לפי הנמוך מביניהם.
20.7. דמי הביטול עשויים להיגבות על ידי בית העסק או על ידי basalon . בכל מקרה של ויתור על גביית דמי הביטול על ידי אחד מאלה, יהא השני זכאי לגבותם, ואין בויתור על גביית דמי הביטול מצד אחד מהם כדי לפגוע בזכות השני לגבותם, בכפוף לכך שלא ייווצר כפל חיוב. רק במקרה בו הן בית העסק והן basalon יוותרו על גביית דמי הביטול, לא יחויב הצרכן בדמי ביטול.
20.8. במקרה של ביטול עסקה עקב פגם או אי התאמה בין הפעילות לבין הפרטים שנמסרו לגביו על ידי basalon לא יחויב הרוכש בדמי ביטול כלשהם.
20.9. יובהר כי ביטול כאמור מתייחס לביטול רכישת הכרטיס על ידי משתמש הקצה בלבד, אך לא לביטול רכישת כל הפעילות ו/או שירות שנרכשו ישירות על ידי משתמש הקצה מבית העסק שלא דרך basalon , שאז על משתמש הקצה לפנות לבית העסק ועל ביטול שכזה יחולו תנאי בית העסק, החוק והדין לגבי מערכת היחסים שבין משתמש הקצה לבין בית העסק. על קבוצת basalon לא תחול כל אחריות בגין ביטול רכישת פעילות ו/או שירות שנרכשו מבית העסק וכל ביטול כאמור יהיה בין משתמש הקצה לבין בית העסק.
20.10. לא תינתן אפשרות של ביטול כרטיס כאמור אם סופקה הפעילות ו/או השירות למשתמש הקצה.
21. אספקת הפעילויות
21.1. אספקת הפעילויות/השירותים תתבצע בהתאם לתנאים המופיעים בתנאי שימוש אלו ובעמוד המכירה של הכרטיס לגבי הפעילות/שירות באתר. אספקת הפעילויות/השירותים תבוצע על ידי בתי העסק ובאחריותם הבלעדית בהתאם לתנאים המופיעים בתנאי שימוש אלו ובעמוד המכירה של הכרטיס לגבי הפעילות/שירות באתר.
21.2. במידה ובית העסק ביטל את הפעילות ו/או השרות יושב למשתמש הקצה הסכום ששולם על ידו בגין הכרטיס לפעילות ו/או השרות בגינו נרכש הכרטיס במלואו בתוך 14 יום מיום קבלת הודעת הביטול.
22. מימוש הכרטיסים
22.1. הכרטיס הנו למימוש חד-פעמי, ולא ניתן לממש כרטיס יותר מפעם אחת. הזכות הנובעת מהכרטיס גלומה בכרטיס המקורי וכל העתק של כרטיס, הינו חסר כל תוקף ולא יקנה כל זכות. אספקת הפעילות ו/או השירות תהייה תוך הצגת הכרטיס עצמו לבית העסק בפרק הזמן שיוצג עליו. ייתכן שבעת מימוש הכרטיס יידרש הרוכש על ידי בית העסק להציג תעודה מזהה.
22.2. אלא אם צוין אחרת במפורש, לא ניתן לשלב שימוש בכרטיס עם שוברים, קופונים, הנחות, הצעות, תעודות צד שלישי ו/או מבצעים אחרים ולא יחול כפל מבצעים.
22.3. מימוש כרטיס יהיה כפוף להוראות כל דין.
22.4. קבוצת basalon ובית העסק לא יהיה אחראים לאובדן ו/או לגניבה ו/או לשכפול ו/או להדפסה ביתר של הכרטיסים ו/או של מספרם הסידורי.
22.5. basalon לא מגבילה מכירת ו/או העברת כרטיס לצד ג, על ידי משתמש הקצה, בתנאי שמכירת ו/או העברת הכרטיסים מותנית בכך שהמוכר או המעביר יתנה את העברה או מכירה כאמור בכך שכל תנאי השימוש ותנאי הכרטיס ימשיכו לחול, לרבות, אך לא רק, הגבלות האחריות של קבוצת basalon , גם כלפי רוכש הכרטיס ו/או מקבלו בהעברה. כל האחריות וההשלכות בכל הקשור ו/או הנובע ממכירת ו/או מהעברת כרטיס לצד ג, לרבות, אך לא רק, במידה וחלות על כך הגבלות ו/או הוראות על פי כל דין, הינן על משתמש הקצה בלבד. בנוסף, כל צד אשר העביר ו/או מכר את הכרטיס ימשיך לשאת באחריות אישית כלפי קבוצת basalon לפי תנאי שימוש אלו.
22.6. כל ניסיון לעשות שימוש בכרטיס בניגוד לתנאים המפורטים לעיל ולהלן או בניגוד לתנאים שיופיעו בהצגת העסקה באתר או על גבי הכרטיס, במצטבר, יגרום לביטול תוקפו של הכרטיס, ללא צורך במתן הודעה מוקדמת מראש.
22.7. כל הכרטיסים מוגבלים בזמן לצורך מימושם כך שתוקפו של הכרטיס יהיה אך ורק לפעילות המסוימת במועד המסוים כפי שצוין בעת רכישת הכרטיס. לא ניתן יהיה לעשות בכרטיס שפג תוקפו כל שימוש והכרטיס לא יקנה לרוכש הכרטיס כל זכות מכל סוג וכן לא יקנה זכות להחזר כספי, בכפוף לכל דין. על כן, באחריות רוכש הכרטיס לממש את הכרטיס להשתתפות בפעילות על פי תוקפו של הכרטיס בלבד. רוכש כרטיס אשר לא מימש את הכרטיס, מכל סיבה שהיא, על פי תוקפו של הכרטיס, יאבד את זכאותו לקבלת הפעילות ו/או השירותים הגלומים בכרטיס ולא יהיה זכאי לכל החזר, תשלום ו/או פיצוי, מכל מין וסוג שהוא.
23. ביטול רכישה על ידי basalon 
basalon ו/או כל מי מטעמה שומרים לעצמם את הזכות להפסיק בכל עת, מכל סיבה שהיא ואף ללא סיבה, על פי שיקול דעתה הבלעדי, את הפעילות באתר, כולה או חלקה, ו/או לבטל מכירה (לפני או לאחר סגירתה), כולה או חלקה, לרבות (מבלי לגרוע מכלליות האמור) בכל אחד מהמקרים המפורטים להלן:
23.1. אם יתברר שהתבצעה או מתבצעת באתר פעילות בלתי חוקית.
23.2. במקרה של כוח עליון, פעולות מלחמה, איבה או טרור המונעים לדעת basalon את המשך המכירה ביצועה או השתתפות מספקת בה.
23.3. במידה ותחול טעות בתום לב בהדפסה, בתיאור הפעילות/השרות, בתנאי המכירה, ו/או במקרה של טעות בהזנת נתוני המכירה ו/או טעות בהזנת הנתונים מהרוכש, רשאית basalon לבטל את הרכישה הספציפית.
23.4. בכל מקרה שנעשתה פעולה בניגוד לתנאי שימוש אלו.
23.5. basalon רשאית לבטל את הזמנת משתמש הקצה, אם ההזמנה בוצעה ללא פרטיו המלאים/המדויקים של משתמש הקצה.
23.6. במידה ובית העסק ביטל את הפעילות ו/או השרות.

24. תכנית מפני משתמשים (“תכנית שותפים”)

24.1. משתמשי קצה יכולים להירשם לתכנית מפני משתמשים באתר (משתמש קצה אשר נרשם לתכנית יכונה ” מפנה משתמשים”). מפנה משתמשים יוכל לסמן פעילויות המוצעות באתר ולקבל מ- basalon לינק ייחודי (“לינק ייחודי”) לאותה הפעילות, אותו יוכל להעלות לאתרים אחרים.

24.1. מפני משתמשים יהיו זכאים לעמלה בשיעור כפי שתודיע להם basalon בכתב (ואשר basalon תהה זכאית לשנות מעת לעת בהודעה בכתב) מהתשלום עבור “הזמנה מזכה” (“עמלת מפנה משתמשים”). “הזמנה מזכה” היא ההזמנה הראשונה בלבד באתר שבוצעה על ידי משתמש קצה שהוכוון לאתר מלינק ייחודי, בהינתן ש- (א) ההזמנה בוצעה תוך 30 ימים מהיום בו הגיע לראשונה משתמש הקצה לעמוד באתר אליו מכווין הלינק הייחודי, ו-(ב) התשלום עבור ההזמנה המזכה לא נעשה כולו באמצעים שאינם מזומן (כגון, מבלי הגבלה, קופונים או קרדיט).

24.2. אם הזמנה מזכה בגינה יש זכאות לעמלת מפנה משתמשים או בגינה עמלת מפנה משתמשים כבר שולמה מבוטלת על ידי משתמש קצה או שתשלום בגינה מוחזר (בצורה מלאה או חלקית, למעט בגין ביטול פעילות על ידי מציע הפעילות), basalon לא תהיה חייבת יותר בתשלום עמלת מפנה משתמשים בגין אותה פעילות. במקרה ו-basalon כבר שילמה עמלת מפנה משתמשים בגין אותה פעילות: (א) מפנה משתמשים יידרש להחזיר את עמלת מפנה משתמשים הרלוואנטית תוך 14 יום מיום ההודעה בכתב על ידי basalon , ו- (ב) ככל שעמלת מפנה המשתמשים לא הוחזרה ל-basalon על ידי מפנה המשתמשים עדיין, basalon תהיה רשאית לקזז אותה העמלה מכל עמלת מפנה משתמשים אחרת שמפנה המשתמשים זכאי או יהיה זכאי לה. עמלת מפנה המשתמשים עבור חודש תחושב על ידי basalon ותהיה סופית ולא ניתנת לערעור על ידי מפנה המשתמשים. עמלת מפנה המשתמשים לה זכאי מפנה המשתמשים תשולם ב-15 לחודש הקלנדארי שלאחר החודש בו בוצעה הפעילות של ההזמנה מזכה או החודש בו בוטלה פעילות זו על ידי מציע הפעילות (לפי העניין) לחשבון Paypal שפרטיו ימסרו על ידי מפנה המשתתפים. מפנה המשתתפים הוא האחראי הבלעדי לכל חבות מס הנוגעת לתשלום מ-basalon והוא ישפה את basalon בגין כל תשלום או חבות שתחויב בו basalon בקשר למיסוי של תשלום כאמור. basalon זכאית לנכות מכל תשלום מס כמחויב לפי חוק. עמלת מפנה המשתמשים היא סכום ברוטו הכולל בתוכו כל מס שיושם על תשלום העמלה (כולל בין היתר כל מס מכירה או שירותים או מע”מ).

24.3 כל מפנה משתמשים מצטרף לתכנית מפני המשתמשים מבחירתו החופשית, ויישא בכל עלות הכרוכה בפעילותו במסגרת תכנית מפני המשתמשים.

24.4. מבלי לגרוע מכל הוראה אחרת של תנאים אלו, מפני משתמשים: (א) יעלו לינקים יחודיים רק לאתרים אשר יש להם הזכות להעלות אליהם את הלינק הייחודי, ויהיו לבדם אחראיים להשיג ולקיים את תנאיו של כל אישור, רישיון או הסכמה הנדרשים לשם פעילות מפנה המשתמשים במסגרת תכנית מפני המשתמשים; (ב) לא יעלו לינק ייחודי לאתר או כל מדיה אחרת אשר מכיל תוכן לא-חוקי, מאיים, פוגעני, מטעה, מעליב, משמיץ, דוחה, חודר/מפר פרטיות, וולגרי, גס, מגונה או באופן אחר מעורר התנגדות, מעודד התנהגות פלילית, מקים עוולה אזרחית ו/או שמפר בדרך אחרת כל חוק ו/או דין ו/או אשר מכיל דבר פרסום או שידול בקשר לפעילויות או שירותים כלשהם שאינם חוקיים ו/או שאינו תואם את מטרות האתר; (ג) לא ישתמש בלינק ייחודי בכל צורה שיש בה הפרת זכויות צד ג’, ספאם, פעילות אי-חוקית, מאיימת, פוגענית, מטעה, מעליבה, משמיצה, דוחה, חודרת/מפרת פרטיות, וולגרית, גסה, מגונה או באופן אחר מעוררת התנגדות, או שמעודד התנהגות פלילית, מקימה עוולה אזרחית ו/או שמפרה בדרך אחרת כל חוק ו/או דין ו/או אשר מפרסמת או משדלת לפעילויות או שירותים כלשהם שאינם חוקיים ו/או שאינו תואם את מטרות האתר או שפוגעות בשמה הטוב או במוניטין של basalon . למען הסר ספק, כל פעולה הקשורה ללינק ייחודי או שהינה במסגרת תכנית מפני המשתמשים תיחשב ‘שימוש’ באתר.

24.5. ל-basalon הזכות, לפי שיקול דעתה הבלעדי, להפסיק את הפעילות של כל לינק ייחודי או להפסיק את תכנית מפני המשתמשים מבלי לספוג כל חבות למפני המשתמשים או צדדים אחרים.

ג. התחשבנות עם בית העסק
25. basalon גובה עמלה בשיעור של 15% בתוספת מע”מ באם נדרש על פי דין (“עמלת basalon “) מכל כרטיס שנרכש על ידי משתמש קצה.
26. basalon תחשב את הסכום המגיע לבית העסק בגין כרטיסים ששולמו לפעילויות ו/או לשירותים שניתנו על ידי בית העסק בניכוי עמלת basalon , בניכוי עלויות סליקת אשראי ו/או עלויות סליקה אחרות (אם וככל שתהיינה), בניכוי ביטולי תשלומים על ידי משתמש הקצה ובניכוי החזרים בגין ביטולים (של בית העסק ושל משתמשי הקצה). חישוב הסכום על ידי basalon הוא סופי ומוחלט.
27. במידה ויגיעו ביטולי עסקאות על ידי משתמש הקצה ו/או בית העסק והסכום אשר מגיע לבית העסק ממכירת כרטיסים עבור הפעילות לא יספיק על מנת לקזז סכומים אלו, יעביר בית העסק את הסכום החסר על פי דרישת basalon ל-basalon בתוך 14 ימים מבקשת התשלום על ידי basalon .
28. הסכום המגיע לבית העסק יועבר לבית העסק בתוך 14 ימים לאחר סוף החודש בו בוצעה הפעילות ו/או ניתן השירות. התשלום יבוצע על ידי אמצעי התשלום אותו תקבע basalon על פי שיקול דעתה הבלעדי.
29. בית העסק הוא האחראי הבלעדי לתשלום כל המיסים הנדרשים על פי החוק.

ד. שונות
30. כותרות הסעיפים נועדו לצרכי נוחות והתמצאות בלבד, ולא יעשה בהן כל שימוש לפרשנות תנאי השימוש.
31. כל זכות, סעד ו/או תרופה של קבוצת basalon על פי הסכם זה לא יגרעו מכל זכות, סעד ו/או תרופה אחרים של קבוצת basalon .
32. הסכם זה הינו לטובת כל חברה המשתייכת לקבוצת basalon ומקנה לכל חברה מקבוצת basalon זכות לאכוף תניות ההסכם. למעט האמור לעיל, הסכם זה אינו חוזה לטובת צד שלישי והוא לא מקנה כל זכות לצד שלישי כלשהו.
33. שום ויתור, הימנעות מפעולה או מתן ארכה הניתנים על ידי basalon לא יחשבו כוויתור על זכויותיה על פי הסכם זה ו/או על פי כל דין, ולא תהווה תקדים ולא ילמדו ממנה גזירה שווה לכל מקרה אחר, ולא יפגעו בזכותה של קבוצת basalon לממש את זכויותיה בכל עת, ולא תשמע כל טענה בדבר ויתור או השהייה.
34. הדין החל על הפעולות באתר ועל תנאי שימוש אלה, הוא הדין הישראלי בלבד. סמכות ייחודית ובלעדית לדון בכל תביעה ו/או בקשה העשויה להיות מוגשת בקשר להסכם זה נתונה לבית משפט בתל- אביב המוסמך לפי העניין.
35. חוסר התקפות של אחד או יותר מתנאי חוזה זה לא תשפיע על תקפות חוזה זה בכללותו. תנאי שאינו תקף או שלא ניתן לאוכפו יוחלף בתנאי תקף אשר יהיה קרוב ביותר לתנאי המקורי שאותו הוא מחליף, עד כמה שניתן על פי החוק.


                    '''),
                  ]),
            ),
          ],
        ),
      ),
    );
  }
}
